       IDENTIFICATION DIVISION.
       PROGRAM-ID.     HELLO.
       ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
       DATA DIVISION.
        WORKING-STORAGE SECTION.
         01 HELLO-MSG PIC X(12).
        LINKAGE SECTION.
       PROCEDURE DIVISION.
       BEGIN.
           MOVE "Hello World!" TO HELLO-MSG
           DISPLAY HELLO-MSG
           GOBACK.